Repository: flathub/flathub
Catalog: retext-man-*.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: ReText - Text editor for Markdown and ReStructuredText
de: ReText - Texteditor für Markdown und ReStructuredText

source: SYNOPSIS
de: ÜBERSICHT

source: B<retext> I<FILE>
de: B<retext> I<DATEI>

source: DESCRIPTION
de: BESCHREIBUNG

source: ReText is a simple editor for Markdown and ReStructuredText markup languages.
de: ReText ist ein einfacher Editor für die Markup-Sprachen Markdown und ReStructuredText.

source: Supported output formats: Plain text, HTML, ODT, PDF. Also, ReText can upload documents to Google Docs.
de: Die folgenden Ausgabeformate werden unterstützt: einfacher Text, HTML, ODT und PDF. ReText ist außerdem in der Lage, Dokumente zu Google Docs zu übertragen.

source: It is written in Python using Qt libraries.
de: Das Programm ist in Python geschrieben und nutzt die Qt-Bibliotheken.

source: AUTHOR
de: AUTOR

source: This manual page was written by Dmitry Shachnev E<lt>mitya57@gmail.comE<gt>.
de: Diese Handbuchseite wurde von Dmitry Shachnev E<lt>mitya57@gmail.comE<gt> geschrieben.

source: WpGen - Webpages generation tool that comes with ReText
de: WpGen - Werkzeug zum Erstellen von Webseiten (in ReText enthalten)

source: B<wpgen> I<COMMAND>
de: B<wpgen> I<BEFEHL>

source: COMMANDS
de: BEFEHLE

source: create new web library
de: erstellt eine neue Web-Bibliothek.

source: generate html files from all pages
de: erzeugt HTML-Dateien aus allen Seiten.

source: B<update> I<file-names>
de: B<update> I<Dateinamen>

source: generate html files from given pages
de: erzeugt HTML-Dateien aus den angegebenen Seiten.

source: B<usestyle> I<style-name>
de: B<usestyle> I<Stilname>

source: use the given style (example: Default, Simple)
de: verwendet den angegebenen Stil (Beispiele: Default, Simple).

source: WpGen allows you to generate webpages from Markdown, ReStructuredText documents and HTML body files. You can use different templates and styles, either standard or created by yourself.
de: WpGen ermöglicht Ihnen die Erstellung von Webseiten aus Markdown- und ReStructuredText-Dokumenten sowie HTML-Rumpfdateien. Sie können verschiedene - entweder vorgegebene oder von Ihnen selbst erstellte - Vorlagen und Stile verwenden.
