Repository: flathub/flathub
Catalog: po/*.po
Languages: es, fr

source: Impossibile trovare il catalogo del programma. Il programma si avviera' in italiano.
es: Imposible encontrar el catalogo del programa. El programa comenzará en italiano.
fr: Impossible de trouver le catalogue de programmes. Le programme commencera en italien.

source: Attenzione
es: Atencion
fr: Attention

source: Il programma verra' chiuso.
es: El programa serà cerrado.
fr: Le programme sera fermé

source: Errore
es: Error
fr: Error

source: &Nuova Partita
es: &Nueva jugada
fr: &Nouveau Jeu

source: Inizia una nuova partita senza concludere l'attuale
es: Empieza una nueva jugada sin concluir la actual
fr: Démarrez un nouveau jeu sans terminer le jeu actuel

source: &Opzioni
es: &Ajustes
fr: Options

source: Imposta le opzioni del programma
es: Selecciona los ajustes del programa
fr: Définir les options du programme

source: Imposta il font utilizzato
es: Selecciona el font utilizado
fr: Définir le font utilisée

source: &Esci
es: &Salir
fr: Sorti&e

source: Chiudi il programma
es: Cierra el programa
fr: Fermer le programme

source: &File
fr: &Fichier

source: &Testo
es: &Texto
fr: &Texte

source: Imposta il colore del testo
es: Selecciona el color del texto
fr: Définir la couleur du Texte

source: S&fondo
es: &Fondo
fr: &Fond

source: Imposta il colore dello sfondo
es: Selecciona el color del fondo
fr: Définit la couleur de fond

source: &Colori
es: &Colores
fr: &Couleurs

source: &Mazzi
es: &Barajas
fr: Jeux

source: &Localizzazioni
es: &Traducciones
fr: &Langages

source: &Sito web del gioco
es: Red &social del juego
fr: & Site Web du jeu

source: Apre il sito web ufficiale
es: Abrir el sitio oficial
fr: Ouvre le site officiel

source: &Informazioni
es: &Informaciones
fr: &Informations

source: Per segnalare un bug o contattare l'autore
es: Para señalar un bug o ponerse en contacto con el autor
fr: Pour signaler un bug ou contacter l'auteur

source: GPL v3 o (a tua discrezione) qualsiasi versione successiva. Le immagini delle carte sono di proprieta' della Modiano
es: GPL v3 o (tu descripcion) cualquiera version actualizada. las imagenes de las cartas son de propriedad della modiano. Super Mario Bros y Club Nintendo son propiedad de Nintendo
fr: GPL v3 ou, selon ton choix n'importe quelle version suivante Le images des cartes sont de propriété de la Modiano Super Mario Bros et Club Nintendo sont la propriété de Nintendo

source: Il gioco della briscola a due giocatori
es: El juego de triunfo de dos jugadores
fr: Émulateur du jeu de l'atout avec deux joueurs

source: Carica il mazzo corrispondente
es: Carga la baraja corrispondiente
fr: Chargez le deck correspondant

source: Carica il file del linguaggio corrispondente
es: Carga el file del lenguaje corrispondiente
fr: Téléchargez le fichier de langue correspondant

source: Impossibile portare a termine l'operazione
es: Imposible llevar acabo la operacion
fr: Impossible de terminer l'opération

source: Il programma si chiudera'. Riaprirlo di nuovo per cambiare il linguaggio.
es: El programa serà cerrado abrelo otra vez para cambiar el lenguaje.
fr: Le programme va s'arrêter. Relancer le manuellement pour changer le langage

source: Nel mazzo rimangono
es: En la baraja sobra
fr: Dans le jeu ça reste

source: carte.
es: cartas.
fr: cartes.

source: Punti di
es: Puntos de
fr: Points de

source: Il seme di briscola e':
es: Il seme de briscola es:
fr: La couleur d'atout:

source: Vuoi effettuare la seconda partita?
es: ¿Quieres efectuar la segunda jugada?
fr: Voulez-vous jouer au deuxième jeu?

source: Continuare?
es: ¿Continuar?
fr: Veux tu continuer

source: La partita e' patta.
es: La jugada es en paridad.
fr: le jeu donne un push.

source: vinto
es: ganado
fr: gagné

source: perso
es: perdido
fr: perdu

source: Hai
es: Tienes
fr: Tu as

source: per
es: por
fr: pour

source: punti.
es: puntos.
fr: points

source: La partita e' finita.
es: La jugada se acabo.
fr: Jeu terminé

source: Vuoi effettuare una nuova partita?
es: ¿Quieres hacer otra jugada?
fr: Voulez-vous jouer à un nouveau jeu?

source: Partita finita
es: Jugada acabada
fr: Jeu terminé

source: Tallone finito
es: Baraja terminada
fr: jeu de cartes terminé

source: Il tallone e' finito
es: La baraja está terminada
fr: le jeu de cartes est terminé

source: Carta di Briscola
es: Carta de triunfo
fr: atout

source: La cpu ha giocato il
es: La cpu reprodujo el
fr: Le processeur a joué le

source: di briscola
es: de triunfo
fr: d'atout:

source: Carta con valore
es: Tarjeta con valor
fr: Carte avec valeur

source: di
es: de
fr: de

source: La partita correntemente in corso verra' interrotta. Continuare?
es: La jugada serà correctamente interrumpida ¿continuar?
fr: La partie actuellement en cours va être arrêtée. Continuer?

source: Richiesta conferma
es: Requerida conferma
fr: Fenetre de confirmation

source: Il file
es: El archivo
fr: Le fichier

source: non esiste.
es: no existe.
fr: n'existe pas.

source: Il programma provera' a ricaricare il mazzo precedente.
es: El programa probarà a recargar la baraja antecediente.
fr: Le programme va chercher de récharger le jeu précédent.

source: Non e' stato possibile caricare il mazzo precedente: uscire dal programma significa non poterlo avviare piu'. Caricare un mazzo completo prima di uscire.
es: No fue posible cargar la baraja antecediente salir del programa significa no poder comenzar de nuevo. Cargue una baraja completa antes de cerrar.
fr: On a pas pus charger le jeu précédent: sortir du programme signifie ne plus le pouvoir démarrer. Charger un jeu entier avant de sortir.

source: Gioco della carta alta
es: Juego de quien tiene la carta con mayor valor
fr: Le jeu de la carte haute

source: Scrivere un numero da 1 a 40 che identifica la carta del mazzo da scegliere.
es: Escribir un numero de 1 a 40 que identifica la carta de la barja da eligir.
fr: Ecrire un numero de 1 à 40 qui identifie la carte du jeu à choisir.

source: Numero della carta da prendere:
es: Numero de la carta de seleccionar:
fr: Numero de la carte a prendre:

source: Annulla
es: Cancelar
fr: Annule

source: Il gioco della carta alta permette di stabilire chi gioca per primo.
es: El juego de la carta permite de establecer quien juega primero.
fr: Le jeu de la carte haute permet d'établir qui joue pour premier

source: Il computer ne scegliera' un'altra e chi avra' il valore maggiore comincera'.
es: El ordenador eligirà otra carta y quien tendrà el valor mayor comenzarà.
fr: L'ordinateur en choisira une autre et qui a la valeur plus grande va commencer

source: Comincia prima il pc
es: Empieza primero el ordenador
fr: L'ordinateur commence

source: Cominci prima tu
es: Empiezas primero tù
fr: C'est toi à commencer

source: Carta tua
es: Tu carta
fr: Ta carte

source: Carta del pc
es: Carta del ordenador
fr: Carte du pc

source: Opzioni
es: Aajustes
fr: Options

source: La carta che designa la briscola puo' dar punti
es: La carta que representa la briscola puede dar puntos
fr: La carte qui montre l'atout peut donner des points

source: Ordina le carte che mi capitano
es: Ordena las cartas que me ocurren
fr: Range les cartes qui arrivent

source: Avvisa quando il tallone finisce
es: Avisar cuando las cartas que tienes que coger acaban
fr: Alerte quand le dos termine

source: Fai il gioco della carta piu' alta all'avvio
es: Haz el juego de la carta mas alta
fr: Le jeu de la carte plus haute au démarrage

source: Abilita la notifica su twitter quando la partita e' finita
es: Habilitar la notificación en twitter cuando termine el juego
fr: Activer la notification sur Twitter lorsque le jeu est terminé

source: Notifica nuove versioni all'avvio
es: Avisa nuenas versiones
fr: Controle les nouvelles versions au démarrage

source: Nome utente:
fr: Nom d'utilisateur:

source: Nome cpu:
fr: Nom de la CPU:

source: Secondi in cui mostrare le giocate
es: El numero de tiempo en el cual tienes que mostrar las cartas
fr: Controle les nouvelles versions au démarrage

source: Bastoni
es: Bastos
fr: Batons

source: Coppe
es: Copas
fr: Coupes

source: Denari
es: Oro
fr: Deniers

source: Spade
es: Espadas
fr: Epées

source: Fiori
es: Tréboles
fr: Cœur

source: Quadri
es: Diamantes
fr: Carreau

source: Cuori
es: Corazones
fr: Trèfle

source: Picche
es: Picas
fr: Pique
